Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC20_DFP/3.4.63/samc20n/edc/ATSAMC20N18A.PIC
      <edc:SFRDef edc:_addr="0x4100A02C" edc:access="-----------------------------nnn" edc:cname="MCFG11" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A030" edc:access="-----------------------------nnn" edc:cname="MCFG12" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A034" edc:access="-----------------------------nnn" edc:cname="MCFG13" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A038" edc:access="-----------------------------nnn" edc:cname="MCFG14" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A03C" edc:access="-----------------------------nnn" edc:cname="MCFG15" edc:impl="0x7" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="ULBT" edc:desc="Undefined Length Burst Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="INFINITE" edc:desc="Infinite Length" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Access" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FOUR_BEAT" edc:desc="Four Beat Burst" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT_BEAT" edc:desc="Eight Beat Burst" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN_BEAT" edc:desc="Sixteen Beat Burst" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A040" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG0" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A044" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG1" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A048" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG2" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A04C" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG3" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A050" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG4" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A054" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG5" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A058" edc:access="-------n--nnnnnn--------nnnnnnnn" edc:cname="SCFG6" edc:impl="0x13F00FF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="HMATRIXHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HMATRIXHS">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:desc="Maximum Number of Allowed Cycles for a Burst" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:desc="Default Master Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_DEFAULT" edc:desc="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LAST_DEFAULT" edc:desc="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_DEFAULT" edc:desc="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:desc="Fixed Index of Default Master" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ARBT" edc:desc="Arbitration Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ROUND_ROBIN" edc:desc="Round-Robin Arbitration" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FIXED_PRIORITY" edc:desc="Fixed Priority Arbitration" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
